fonecmid-diplom/src/Documents/ВКМ_Задача/ВКМ_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_Задача</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ВКМ_ЗаписиЗадач</registerRecords>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ВКМ_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПовтор</name>
    <comment>Для расписания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРасписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПовторов</name>
    <attributes>
      <name>ДатаПовтора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удаленный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_Задача/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Начало > Окончание Тогда
		Сообщить("Конец задачи не может быть раньше, чем начало задачи.");
		Отказ = Истина;
	КонецЕсли; 
		
	Дата = НачалоДня(Дата); 
	
	// Заполняем реквизит текущим значением параметра сеанса
	Если Пользователь.Пустая() Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
КонецПроцедуры  

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТаблицаПовторов.Очистить();
	ЕстьПовтор = Ложь;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    // Удаляем помеченные документы
	Если ПометкаУдаления Тогда
		Движения.ЗаписиЗадач.Записать();
		Возврат;
	КонецЕсли;
	
	// регистр ЗаписиЗадач
	Движения.ЗаписиЗадач.Записывать = Истина;
	// Повторый отсуствуют
	Если НЕ ЕстьПовтор Тогда
		Движение = Движения.ЗаписиЗадач.Добавить();
		Движение.Период = Дата;
		Движение.ВремяНачала = Начало;
		Движение.ВремяОкончания = Окончание;
		Движение.Пользователь = Пользователь;
	Иначе
		// ТЧ документа
		Для каждого ТекСтрока Из ТаблицаПовторов Цикл
			Если ТекСтрока.Удаленный Тогда
				// Пропуск строки
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ЗаписиЗадач.Добавить();	
			// Есть замещения
			Если ЗначениеЗаполнено(ТекСтрока.ДатаЗамещения) Тогда
				Движение.Период = ТекСтрока.ДатаЗамещения;
				Движение.ВремяНачала = ТекСтрока.ВремяНачалаЗамещения;
				Движение.ВремяОкончания = ТекСтрока.ВремяОкончанияЗамещения;
			// Замещений нет	
			Иначе
				Движение.Период = ТекСтрока.ДатаПовтора;
				Движение.ВремяНачала = Начало;
				Движение.ВремяОкончания = Окончание;
			КонецЕсли;
			Движение.Пользователь = Пользователь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
